package com.java_essential.safonov.homework.lesson6.Animals;
/*
Создайте перечислительный тип (enum) Animals, содержащий конструктор,
который должен принимать целочисленное значение (возраст животного), и
 содержать перегруженный метод toString(), который должен возвращать
 название экземпляра и возраст животного.
 */

public class Main {
    public static void main(String[] args) {
        Animals animals = null;

        System.out.println(animals.ANIMALS);
        System.out.println(animals.ANIMALS1);
        System.out.println(animals.ANIMALS2);
        System.out.println(animals.ANIMALS3);

    }
}



