package com.java_essential.safonov.homework.lesson6.Vehicle1;

/*
Создайте перечислительный тип (enum) Vehicles, содержащий конструктор,
который должен принимать целочисленное значение (стоимость автомобиля),
текстовое значение (марка автомобиля), содержать метод getColor(),
который возвращает строку с цветом автомобиля, и содержать перегруженный метод toString(),
который должен возвращать строку с названием экземпляра, цветом и стоимостью автомобиля.
В enum Vehicles создайте на Ваш выбор хотя-бы пять его экземпляров.
 */
public class Main {
    public static void main(String[] args) {
        Vehicles vehicles = null;

        System.out.println(vehicles.Vehicles1);
        System.out.println(vehicles.Vehicles2);
        System.out.println(vehicles.Vehicles3);
        System.out.println(vehicles.Vehicles4);
        System.out.println(vehicles.Vehicles5);


    }
}
